Devashrutha/SensLink-Vision/STM32 C Master/Sensor_Platform/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LORA_NSS_Pin GPIO_PIN_1
#define LORA_NSS_GPIO_Port GPIOA
#define SD_CARD_BUTTON_Pin GPIO_PIN_3
#define SD_CARD_BUTTON_GPIO_Port GPIOA
#define SD_CARD_BUTTON_EXTI_IRQn EXTI3_IRQn
#define LORA_DIO0_Pin GPIO_PIN_4
#define LORA_DIO0_GPIO_Port GPIOA
#define LORA_DIO0_EXTI_IRQn EXTI4_IRQn
#define BARO_INT_Pin GPIO_PIN_1
#define BARO_INT_GPIO_Port GPIOB
#define BARO_INT_EXTI_IRQn EXTI1_IRQn
#define MCU_LED_Pin GPIO_PIN_12
#define MCU_LED_GPIO_Port GPIOB
#define SD_CARD_DETECT_Pin GPIO_PIN_13
#define SD_CARD_DETECT_GPIO_Port GPIOB
#define IMU_INT_Pin GPIO_PIN_8
#define IMU_INT_GPIO_Port GPIOB
#define IMU_INT_EXTI_IRQn EXTI9_5_IRQn

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
